blog-posts/2009-02-09-planning-meetings-get-togethers-and-interviews-with-agreeadate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Planning meetings, get-togethers, and interviews with AgreeADate</title>
<!-- 2015-10-19 Mon 14:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Planning meetings, get-togethers, and interviews with AgreeADate</h1>
<p>
February 9th, 2009 -
<a href="http://sachachua.com/blog/p/5723"><a href="http://sachachua.com/blog/p/5723">http://sachachua.com/blog/p/5723</a></a>
</p>

<p>
One of the reasons why I love thinking of ways to help people rock even
more is that I often end up learning a lot in the process.
</p>

<p>
For example, last week, I needed to*coordinate schedules* with Katie
Bartlett, Jeff Widman's assistant, for a chat with Jeff about
networking. I thought about how much e-mail was sent back-and-forth
figuring out <b>times and timezones</b>, and I multiplied that by the number
of appointments Katie probably needed to arrange. <b>That sounded like a
lot of work.</b> If I could find a tool to make that easier for our
appointment, and she used that tool to organize lots of other
appointments, then that would be great!
</p>

<p>
I checked out a couple of tools such as
<a href="http://timetomeet.com">TimeToMeet</a>,
<a href="http://scheduleonce.com">ScheduleOnce</a>, and
<a href="http://www.agreeadate.com">AgreeADate</a>. Of the tools I tried, I liked
AgreeADate the most because it made it easy to create different kinds of
schedules and it supported timezones. I sent Katie a few potential
timeslots for my chat with Jeff. After she replied, I confirmed the time
that was mutually convenient. <b>That wasn't hard at all.</b>
</p>

<p>
Then I explored the other features. I found out that I could create a
schedule where people could pick a slot. AgreeADate allowed me to
specify <b>how many people each timeslot was limited to, and how many
slots people could choose.</b> This opened up all sorts of possibilities,
and has become my favorite feature!
</p>

<p>
Things that I'd formerly had been worried about scheduling became so
much easier to schedule because I could create all the slots in parallel
and then let people choose the slots that hadn't been taken yet. For
example, I'd been meaning to try outsourcing some technical and personal
tasks, but <b>scheduling interview times sounded like a hassle.</b> With this
system, I just had to <b>set all the slots up and invite people to choose</b>
the timeslot most convenient for them. Yay!
</p>

<p>
AgreeADate isn't perfect, but it makes scheduling things so much easier
for me, and it <b>lowers the barrier</b> enough for me to go and make things
happen. In the past week that I've been trying it out, I've:
</p>

<ul class="org-ul">
<li>scheduled a capoeira trial
</li>
<li>scheduled a conference call
</li>
<li>set up interviews for a system administrator and a virtual assistant,
and
</li>
<li>set up lunch with a poll on where to eat.
</li>
</ul>

<p>
You know, stuff that would've taken way too much e-mail if I had to do
it by hand. =)
</p>

<p>
I'd like to see it integrated with my Google Calendar, and one of the
AgreeADate folks told me that that's the next thing on their roadmap. I
found myself wondering which slots I'd tentatively offered for other
events, and being able to see all the tentative slots overlaid on my
calendar would be fantastic.
</p>

<p>
In the meantime, I read the confirmation e-mails in Emacs Gnus, use
Remember and Org to create an appointment hyperlinked to that mail, and
then use my own code, the twit.el library, and the
<a href="http://www.twittercal.com">Twittercal</a> service to create an
appointment on my Google Calendar (on google.com), which is then shared
with my Google Calendar on sachachua.com thanks to the joys of Google
Apps. It's quite Rube Goldberg-esque (as many of my bubblegum-and-string
tricks are), but so far, it works. Maybe this'll be something I'll
outsource (except perhaps without the Gnus + Remember + Org part) once
I've gotten that virtual assistance thing sorted out. =)
</p>

<p>
For the geeks, some Emacs Lisp to mash together with Org, TwitterCal,
Google Calendar, and twit.el (some wizardry required):
</p>

<pre class="example">
(defun sacha/org-as-gcal-quick-add ()
  "Convert the current SCHEDULED: timestamp and header into a GCal quick add item."
  (save-excursion
    (org-back-to-heading t)
    (setq end (save-excursion (outline-next-heading) (point)))
    (when (re-search-forward org-scheduled-time-regexp
                 end t)
      (let (ts default-time stamp plain s0 srp s1 s2)
    (setq ts (match-string 1)
          default-time (apply 'encode-time (org-parse-time-string ts)))
    (when (or (setq stamp (string-match org-stamp-time-of-day-regexp ts))
          (setq plain (string-match org-plain-time-of-day-regexp ts)))
      (setq s0 (match-string 0 ts)
        srp (and stamp (match-end 3))
        s1 (match-string (if plain 1 2) ts)
        s2 (match-string (if plain 8 (if srp 4 6)) ts)))
    (cond
     (s2
      (concat (org-no-properties (org-get-heading t)) " on "
          (format-time-string "%x" default-time) " from "
          (org-get-time-of-day s1 'string t) " to "
          (org-get-time-of-day s2 'string t)
          ))
     (s1

      (concat (org-no-properties (org-get-heading t)) " on "
          (format-time-string "%x" default-time) " from "
          (org-get-time-of-day s1 'string t)
          ))
     (t
      (concat (org-no-properties (org-get-heading t)) " on "
          (format-time-string "%x" default-time)
          )
      ))))))

(defun sacha/org-to-twittercal (string)
  "Post STRING to TwitterCal. See http://www.twittercal.com for details."
  (interactive (list (read-string "Event: " (sacha/org-as-gcal-quick-add))))
  (twit-post-function twit-update-url (concat "d gcal " string)))
</pre>

<p>
I'll keep you posted on my experiments! =)
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
